app/controllers/game_controller.rb

  def show
    return render :json => {:game => @game.id,
                            :active => @game.active?,
                            :num_guesses => @game.num_guesses,
                            :guesses => @game.guesses.collect(&:guess),
                            :charset => @game.charset.to_s,
                            :slots => @game.guess_slots}
---
SELECT "guesses".* FROM "guesses" WHERE "guesses"."game_id" = 1